In [3]:
import pandas as pd
import numpy as np
adams_act = pd.DataFrame(
                [
                  [12, 92],
                  [13, 65],
                  [14, 96]
                ],
                   columns=['Date', 'Act'])
print(adams_act)

   Date  Act
0    12   92
1    13   65
2    14   96

In [4]:
adams_act.idxmin()

Date    0
Act     1
dtype: int64

In [5]:
adams_act.idxmin(axis=1)

0    Date
1    Date
2    Date
dtype: object

In [6]:
adams_act.idxmax()

Date    2
Act     2
dtype: int64

In [7]:
adams_act.cummin()

   Date  Act
0    12   92
1    12   65
2    12   65

In [8]:
adams_act.cummax()

   Date  Act
0    12   92
1    13   92
2    14   96

In [9]:
adams_act.cumsum()

   Date  Act
0    12   92
1    25  157
2    39  253

In [10]:
adams_act.cumprod()

   Date     Act
0    12      92
1   156    5980
2  2184  574080

In [11]:
adams_act.diff()

   Date   Act
0   NaN   NaN
1   1.0 -27.0
2   1.0  31.0

In [12]:
adams_act.pct_change()

       Date       Act
0       NaN       NaN
1  0.083333 -0.293478
2  0.076923  0.476923

In [13]:
adams_act.expanding().sum()

   Date    Act
0  12.0   92.0
1  25.0  157.0
2  39.0  253.0

In [14]:
adams_act.expanding().mean()

   Date        Act
0  12.0  92.000000
1  12.5  78.500000
2  13.0  84.333333

In [15]:
adams_act.expanding(min_periods=3).sum()

   Date    Act
0   NaN    NaN
1   NaN    NaN
2  39.0  253.0

In [16]:
adams_act.rolling(window=2).sum()

   Date    Act
0   NaN    NaN
1  25.0  157.0
2  27.0  161.0

In [17]:
adams_act.rolling(window=2).mean()

   Date   Act
0   NaN   NaN
1  12.5  78.5
2  13.5  80.5

In [18]:
adams_act.rolling(window=3).sum()

   Date    Act
0   NaN    NaN
1   NaN    NaN
2  39.0  253.0

In [19]:
adams_act.rolling(window=3).mean()

   Date        Act
0   NaN        NaN
1   NaN        NaN
2  13.0  84.333333